///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
/*----------- Start : Importing Modules And Using Prompt -----------*/
import promptSync from 'prompt-sync';


                    const prompt = promptSync();

/*----------- End : Importing Modules And Using Prompt -----------*/
//////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////
/*------------------- Start : Creating Variables -------------------------*/
const delay = (ms) => new Promise(resolve => setTimeout(resolve, ms));

/*------------------- END : Creating Variables -------------------------*/
 //////////////////////////////////////////////////////////////////////////////     
 //////////////////////////////////////////////////////////////////////////////          
/*------------------- Start : Creating Functions -------------------------*/
async function actionChoice(choice) {
                            console.clear();

                                    if (choice==='1') {
                                        console.log('คุณเลือก: ' + choice + ' คุณได้เลือกเริ่มเล่นเกม');
                                        const name = prompt('กรุณากรอกชื่อตัวละครของคุณค่ะ >> '); 
                                        console.log('ยินดีต้อนรับเข้าสู่เกม Find Your Hat, ' + name + '!');
                                    }

                                    else if (choice === '2') {
                                     console.log('ขอบคุณที่แวะเข้ามาทักทายค่ะ! ลาก่อนนะค่ะ. . .');
                                     console.log('โปรแกรมจะปิดตัวลงใน 3 วินาที (หากไม่ปิดอัตโนมัติ กรุณากดปุ่ม Ctrl + C จำนวน 2 ครั้งเพื่อปิดโปรแกรม)');

                                     await delay(3000);
                                     process.exit();
                                    }
                            }

/*------------------- END : Creating Functions -------------------------*/
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
/*--------------------- Start : Main Program ----------------------------*/  
console.clear()
console.log('=== ยินดีตอนรับเข้าสู๋ Find Your Hat ===');
console.log('1. เริ่มเกม (Start Game)');
console.log('2. ออกจากเกม (Exit)');
const choice = prompt('เลือกรายการ (1 หรือ 2) >> ');
await actionChoice(choice);

/*----------------------- END : Main Program ---------------------------*/
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////